Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J73.tmx
Source language: en_us
Languages: zh_cn

source: Chapter 3 Form & Space
zh_cn: 3 形式与空间

source: “We put thirty spokes together and call it a wheel; but it is on the space where there is nothing that the utility of the wheel depends.
zh_cn: “三十辐共一毂，当其无，有车之用；

source: We turn clay to make a vessel; but it is on the space where there is nothing that the utility of the vessel depends.
zh_cn: 埏埴以为器，当其无，有器之用；

source: We pierce doors and windows to make a house; and it is on these spaces where there is nothing that the utility of the house depends.
zh_cn: 凿户牖以为室，当其无，有室之用。

source: Therefore, just as we take advantage of what is, we should recognize the utility of what is not.”
zh_cn: 故有之以为利，无之以为用。”

source: Lao-tzu
zh_cn: 老子

source: Tao Te Ching
zh_cn: 《道德经》

source: 6th century B.C.
zh_cn: 公元前6世纪

source: Space constantly encompasses our being.
zh_cn: 空间连续不断地包围着我们。

source: Through the volume of space, we move, see forms, hear sounds, feel breezes, smell the fragrances of a flower garden in bloom.
zh_cn: 通过空间的容积，我们进行活动、观察形体、听到声音、感受清风、闻到百花盛开的芳香。

source: It is a material substance like wood or stone.
zh_cn: 空间像木材和石头一样，是一种实实在在的物质。

source: Yet it is an inherently formless vapor. Its visual form, its dimensions and scale, the quality of its light—all of these qualities depend on our perception of the spatial boundaries defined by elements of form.
zh_cn: 然而，空间天生是一种不定形的东西，它的视觉形式、它的维度和尺度、它的光线特征一所有这些特点都依赖于我们的感知，即我们对于形体要素所限定的空间界限的感知。

source: As space begins to be captured, enclosed, molded, and organized by the elements of mass, architecture comes into being.
zh_cn: 当空间开始被体块要素所捕获、围合、塑造和组织的时候，建筑便产生了。

source: Temple of Kailasnath at Ellora, near Aurangabad, India, A.D. 600-l000
zh_cn: Temple of Kailasnath at Ellora. near Aurangabad， India， A.D. 600-1000 埃洛拉的凯拉思纳斯神庙，奥兰加巴德附近，印度，公元600--1000年

source: The Pantheon, Rome, A.D. 120-124
zh_cn: The Pantheon， Rome， A.D. 120-124 万神庙，罗马，公元120--124年

source: FORM & SPACE: THE UNITY OF OPPOSITES
zh_cn: 形式与空间：对立的统一

source: Our visual field normally consists of heterogeneous elements that differ in shape, size, color, or orientation.
zh_cn: 在我们的视野中，通常包含不同种类的要素，这些要素的形状、尺寸、颜色或方向都不相同。

source: To better comprehend the structure of a visual field, we tend to organize its elements into two opposing groups: positive elements, which are perceived as figures and negative elements, which provide a background for the figures.
zh_cn: 为了更好地理解一个视野的结构，我们往往把其中的要素归为相反的两组：被理解为图的正 要素和给图提供背景的负要素。

source: Our perception and understanding of a composition depends on how we interpret the visual interaction between the positive and negative elements within its field.
zh_cn: 我们对于一个构图的感知和理解，取决于我们如何解释图形中正要素与负要素之间的视觉作用。

source: On this page, for example, letters are seen as dark figures against the white background of the paper surface.
zh_cn: 比如，在本页中，字母对于纸面的白底而言可以看做是黑色的图。

source: Consequently, we are able to perceive their organization into words, sentences, and paragraphs.
zh_cn: 因而我们可以感知这些字母所组成的单词、句子和段落。

source: In the diagrams to the left, the letter “a” is seen as a figure not only because we recognize it as a letter in our alphabet but also because its profile is distinct, its value contrasts with that of its background, and its placement isolates it from its context.
zh_cn: 在左侧的图里，字母‘a’被看做为图，这不仅仅因为我们知道它是字母表中的一个字母，而且还因为它的外形独特，其明度与背景形成对比，并且它所在的位置使其与背景隔离开来。

source: As it grows in size relative to its field, however, other elements within and around it begin to compete for our attention as figures.
zh_cn: 但是，随着它的尺寸相对于它所处的范围而增大的时候，字母当中或字母周围的其他要素就开始作为图来争夺我们的注意力。

source: At times, the relationship between figures and their background is so ambiguous that we visually switch their identities back and forth almost simultaneously.
zh_cn: 有时，图与底之间的关系变得非常含糊，以至于我们的视觉会同时不停地切换它们的图底属性。

source: White-on-Black or Black-on-White?
zh_cn: 白图黑底还是黒图白底？

source: Two Faces or a Vase?
zh_cn: 是两幅面孔还是一个花瓶？

source: In all cases, however, we should understand that figures, the positive elements that attract our attention, could not exist without a contrasting background.
zh_cn: 但是，在所有的情况下我们都必须明白：吸引我们注意力的正要素“图”，如果没有一个与之形成对比的背景，那是不可能存在的。

source: Figures and their background, therefore, are more than opposing elements.
zh_cn: 因此，图与底的关系不仅仅是对立的要素。

source: Together, they form an inseparable reality—a unity of opposites—just as the elements of form and space together form the reality of architecture.
zh_cn: 二者共同形成一个不可分离的实体，一个对立的统一体，就像形式与空间要素共同形成了建筑实物一样。

source: Line defining the boundary between solid mass and spatial void
zh_cn: A. 线限定了实体与虚空之间的界限

source: The form of solid mass rendered as a figure
zh_cn: B. 实体的形式被表现为“图”

source: The form of the spatial void rendered as a figure
zh_cn: C. 虚实的形式被表现为“图”

source: Plan Diagrams, Taj Mahal, Agra, India, 1630-1653.
zh_cn: 泰姬·玛哈陵·阿格拉，印度，1630—1653

source: Shah Jahan built this white marble mausoleum for his favorite wife, Muntaz Mahal.
zh_cn: 沙贾汗（Shah Jahan ）为他的爱妻玛塔兹·玛哈尔（Muntaz Mahal）建造了这座白色大理石的陵墓。

source: Architectural form occurs at the juncture between mass and space.
zh_cn: 建筑形式出现在实体与空间的接合上。

source: In executing and reading design drawings, we should be concerned with both the form of the mass containing a volume of space as well as the form of the spatial volume itself.
zh_cn: 在实施与阅读设计图纸时，我们既要关注包含空间体积的实体形式，也要关注空间容积本身的形式。

source: Fragment of a Map of Rome, drawn by Giambattista Nolli in 1748
zh_cn: 罗马地图片段，詹巴蒂斯塔·诺里于1748年绘制

source: Depending on what we perceive to be positive elements, the figure-ground relationship of the forms of mass and space can be inverted in different parts of this map of Rome.
zh_cn: 在这幅罗马地图的不同部位上，取决于我们把何者视为正要素，实体形式与空间形式之间的图底关系可以颠倒。

source: In portions of the map, buildings appear to be positive forms that define street spaces.
zh_cn: 在这幅地图的有些部分，建筑物似乎是正要素，限定了街道空间。

source: In other parts of the drawing, urban squares, courtyards, and major spaces within important public buildings read as positive elements seen against the background of the surrounding building mass.
zh_cn: 在该地图的另外一些部分，城市广场、庭院以及重要公共建筑中的主要空间则被当做正要素，与作为背景的、周围环境中的建筑实体形成对比。

source: The symbiotic relationship of the forms of mass and space in architecture can be examined and found to exist at several different scales.
zh_cn: 可以通过分析发现，建筑中买体形式与空间形式之间的共生关系存在着几种不同的程度。

source: At each level, we should be concerned not only with the form of a building but also its impact on the space around it.
zh_cn: 无论在哪种程度上，我们不仅要考虑建筑的形式，而且还要考虑它对周围空间的影响。

source: At an urban scale, we should carefully consider whether the role of a building is to continue the existing fabric of a place, form a backdrop for other buildings, or define a positive urban space, or whether it might be appropriate for it to stand free as a significant object in space.
zh_cn: 在一个城市尺度范围内，我们应该精心考虑一座建筑物的责任，是延续一个场所的现有结构，给其他建筑物当背景，还是限定一个明确的城市空间，抑或作为城市空间中的一个重要物体而适合于独立存在。

source: At the scale of a building site, there are various strategies for relating the form of a building to the space around it.
zh_cn: 在一座建筑物的基地范围内，有各种各样的方法来处理建筑物与周围空间的关系。

source: A building can:
zh_cn: —座建筑物可以：

source: A. form a wall along an edge of its site and begin to define a positive outdoor space;
zh_cn: A. 沿着基地的边缘形成一面墙，并且限定明确的室外空间；

source: B. merge its interior space with the private outdoor space of a walled site;
zh_cn: B. 将其室内空间与围墙范围以内的、私有室外空间融为一体；

source: C. enclose a portion of its site as an outdoor room and shelter it from undesirable climatic conditions;
zh_cn: C. 围起基地的一部分作为室外场地，使这部分室外场地能够遮风避雨；

source: D. surround and enclose a courtyard or atrium space within its volume— an introverted scheme.
zh_cn: D. 在建筑物的内部容积中，环绕或围合一个庭院或中庭空间——这是一种内向的设计；

source: Monastery of St. Meletios on Mt. Kithairon, Greece, 9th century A.D.
zh_cn: 基塞隆山上的圣梅勒修斯修道院，希腊，公元9世纪

source: E. stand as a distinct object in space and dominate its site through its form and topographical positioning—an extroverted scheme;
zh_cn: E. 作为一个独特的实体立于空间之中，并通过其形式和外部特征控制着建筑物所在的基地——这是一种外向的设计；

source: F. stretch out and present a broad face to address a view, terminate an axis, or define an edge of an urban space;
zh_cn: F.立面宽阔舒展，与景观对话，作为一条轴线的终点或限定某一城市空间的边界；

source: G. stand free within its site but extend its interior spaces to merge with private exterior spaces;
zh_cn: G.在基地内自由排布，但室内空间延伸出去，与私有的室外空间融为一体；

source: H. stand as a positive form in a negative space.
zh_cn: H.在负空间中作为一个正的形体而存在。

source: Buildings Defining Space: Piazza San Marco, Venice
zh_cn: 建筑物限定了空间：圣马可广场，威尼斯

source: Building as an Object in Space: Boston City Hall, 1960, Kallmann, McKinnell & Knowles
zh_cn: 建筑物作为空间中的一个实体：波士顿市政厅，1960，卡尔曼，麦金尼尔及诺尔斯

source: Building Embedded in the Landscape: Eyup Cultural Center, Istanbul, Turkey, 2013, EAA-Emre Arolat Architects
zh_cn: 建筑物嵌入景观：埃郁普文化中心，伊斯坦布尔，土耳其，2013， EAA—埃姆瑞·阿罗拉特建筑师事务所

source: Building Dominating the Landscape: Cooroy Art Temple, Cooroy Mountain, Australia, 2008, Paolo Denti JMA Architects
zh_cn: 建筑物主宰者景观：库洛依艺术圣殿，库洛依山，澳大利亚，2008，保罗·邓蒂JMA建筑师事务所

source: Building as Landscape: Palafolls Public Library, Palafolls, Spain, 2009, Enric Miralles and Benedetta Tagliabue/Miralles Tagliabue EMBT
zh_cn: 建筑物即为景观：帕拉福尔斯公共图书馆，帕拉福尔斯，西班牙，2009，恩里克·米拉雷斯与贝妮蒂塔·塔格丽娅布/米拉雷斯·塔格丽娅布EMBT事务所

source: Landscape as Building: Olympic Sculpture Park, Seattle Art Museum, Seattle, Washington, 2008, Weiss/Manfredi Architecture/Landscape/Urbanism
zh_cn: 景观成为建筑：奥林匹克雕塑公园，西雅图艺术博物馆，西雅图，华盛顿州，2008，韦斯/曼弗雷迪建筑/景观/城市规划设计公司

source: At the scale of a building, we tend to read the configurations of walls as the positive elements of a plan.
zh_cn: 在一栋建筑物的尺度范围内，我们倾向于把墙的造型当成平面图中的正要素。

source: The white space in between, however, should not be seen simply as background for the walls, but also as figures in the drawing that have shape and form.
zh_cn: 但是墙之间的空白空间不应当简单地视为墙的背景，而应当视为有形状和形式的图形。

source: Even at the scale of a room, articles of furnishings can either stand as forms within a field of space or serve to define the form of a spatial field.
zh_cn: 即使是在一个房间的尺度范围内，家具物品既可以作为形式而立于某一空间领域中，也可以用来限定空间领域的形式。

source: Seinajoki Theater, Finland,i968-1969, Alvar Aalto
zh_cn: 塞纳约基的剧院，芬兰，1968--1969，阿尔瓦·阿尔托

source: The form and enclosure of each space in a building either determines, or is determined by, the form of the spaces around it.
zh_cn: 在建筑中，每个空间的形式和围护结构，不是决定了其周围的空间形式就是被周围的空间形式所决定。

source: In the Theater in Seinajoki by Alvar Aalto, for example, we can distinguish several categories of spatial forms and analyze how they interact.
zh_cn: 比如，在阿尔瓦·阿尔托设计的塞纳约基剧院中，我们可以分辨出好几种类型的空间形式，可以分析这些空间形式是如何相互作用的。

source: Each category has an active or passive role in defining space.
zh_cn: 每一种类型，在限定空间方面都有主动或被动的作用。

source: Some spaces, such as offices, have specific but similar functions and can be grouped into single, linear, or clustered forms.
zh_cn: A. 某些空间，例如办公室，用途虽各异，但有相同的功能，可以把它们组成独立的、线性的或组团的形式。

source: Some spaces, such as concert halls, have specific functional and technical requirements, and require specific forms that will affect the forms of the spaces around them.
zh_cn: B.某些空间，例如音乐厅，具有特殊的功能和技术要求，因而需要特殊的形体，由此会影响到其周围空间的形式。

source: Some spaces, such as lobbies, are flexible in nature and can therefore be freely defined by the spaces or grouping of spaces around them.
zh_cn: C. 某些空间，例如门厅，其性质是灵活的，因此可以被周围的空间或空间组团自由划分。

source: FORM DEFINING SPACE
zh_cn: 形式限定空间

source: Square in Giron, Colombia, South America
zh_cn: 吉隆的广场，哥伦比亚，南美

source: When we place a two-dimensional figure on a piece of paper, it influences the shape of the white space around it.
zh_cn: 当我们把一幅两维的图形布置在一张纸上的时候，它会影响到周围白色空间的形状。

source: In a similar manner, any three-dimensional form naturally articulates the volume of space surrounding it and generates a field of influence or territory which it claims as its own.
zh_cn: 同理，任何三维的形式自然会清晰地表达出其周围的空间体积，并且产生一个受到影响的范围或能够据为己有的领地。

source: The following section of this chapter looks at horizontal and vertical elements of form and presents examples of how various configurations of these formal elements generate and define specific types of space.
zh_cn: 本章的其余部分着眼于水平和垂直的形式要素，并举例说明这些形式要素构成的图形，是如何产生并限定特定空间类型的。

source: HORIZONTAL ELEMENTS DEFINING SPACE
zh_cn: 水平要素限定的空间

source: Base Plane
zh_cn: 基面

source: A horizontal plane laying as a figure on a contrasting background defines a simple field of space.
zh_cn: 一个水平面作为一个图形平放在反差很大的背景上，就限定出一个简单的空间领域。

source: This field can be visually reinforced in the following ways.
zh_cn: 用下面几种方法可以使该领域在视觉上得到加强。

source: Elevated Base Plane
zh_cn: 基面抬升

source: A horizontal plane elevated above the ground plane establishes vertical surfaces along its edges that reinforce the visual separation between its field and the surrounding ground.
zh_cn: 水平面拾升到地面以上，则会沿着水平面的边界生成若干个垂直表面，这就在视觉上强化了该领域与周围地面之间的分离感。

source: Depressed Base Plane
zh_cn: 基面下沉

source: A horizontal plane depressed into the ground plane utilizes the vertical surfaces of the lowered area to define a volume of space.
zh_cn: 一个水平面下沉到地面以下，利用下沉部分的垂直表面来限定一个空间容积。

source: Overhead Plane
zh_cn: 顶面

source: A horizontal plane located overhead defines a volume of space between itself and the ground plane.
zh_cn: 水平面位于头顶之上，则在顶面与地面之间限定出一个空间容积

source: For a horizontal plane to be seen as a figure, there must be a perceptible change in color, tone, or texture between its surface and that of the surrounding area.
zh_cn: 为了使一个水平面能被看成一个图形，在其表面与周围区域的表面之间，必须在色彩、明度或质感上具有可以感知的变化。

source: The stronger the edge definition of a horizontal plane is, the more distinct will be its field.
zh_cn: 水平面的边界越清晰，则其领域越明确。

source: Although there is a continuous flow of space across it, the field nevertheless generates a spatial zone or realm within its boundaries.
zh_cn: 虽然有连续不断的空间穿越其间，但无论如何，该领域会在它的边界内产生一个空间区域或空间地带。

source: The surface articulation of the ground or floor plane is often used in architecture to define a zone of space within a larger context.
zh_cn: 在建筑中，地面或楼面的接合常常用来在更大的背景中限定一个空间区域。

source: The examples on the facing page illustrate how this type of spatial definition can be used to differentiate between a path of movement and places of rest, establish a field from which the form of a building rises out of the ground, or articulate a functional zone within a one-room living environment.
zh_cn: 下一页的实例清楚地表明了，这类限定空间的方法是如何用来区分行动路线和休息区域，如何在建筑形体拔地而起的地方建立起一个领域，或者如何在一个房间的起居环境中明确地划分出一个功能区。

source: Street in Woodstock, Oxfordshire, England
zh_cn: 伍德斯托克的街道，牛津郡，英格兰

source: Katsura Imperial Villa, Kyoto, Japan, 17th century
zh_cn: 桂离宫，京都，日本，17世纪

source: Parterre de Broderie, Palace of Versailles, France, 17th century, Andre Le Notre
zh_cn: 刺绣花坛，凡尔赛宫，法国，17世纪，安德烈·勒·诺特

source: Interior of Glass House, New Canaan, Connecticut, 1949, Philip Johnson
zh_cn: 玻璃住宅室内，新坎南，康涅狄格州，1949，菲利浦?约翰逊

source: ELEVATED BASE PLANE
zh_cn: 基面抬升

source: Elevating a portion of the base plane creates a specific domain within a larger spatial context.
zh_cn: 将基面的一部分抬升，会在更大的空间范畴内创造一个特定的空间领域。

source: The changes in level that occur along the edges of the elevated plane define the boundaries of its field and interrupt the flow of space across its surface.
zh_cn: 沿着抬高了的平面边缘所发生的高度变化，限定了其领域的界限并打断了穿过其表面的空间。

source: If the surface characteristics of the base plane continues up and across the elevated plane, then the field of the elevated plane will appear to be very much a part of the surrounding space.
zh_cn: 如果基面抬升所形成的侧表面继续向上伸展，并超过了已经抬高的基面，那么抬高了的基面所限定的范围，看起来很像周围空间的一部分。

source: If, however, the edge condition is articulated by a change in form, color, or texture, then the field will become a plateau that is separate and distinct from its surroundings.
zh_cn: 然而，如果边界在形式、色彩或质感等方面 发生了明确的变化，那么这个范围便成为一块高地，与周围环境分离而且区别明显。

source: Fatehpur Sikri, Palace Complex of Akbar the Great, Mogul Emperor of India, 1569-1574.
zh_cn: 法塔赫布尔·西格里（“胜利之城”的意思），印度莫卧尔大帝阿克巴的宫殿群，1569--1574

source: A special place is established by a platform in an artificial lake surrounded by the emperor’s living and sleeping quarters.
zh_cn: 通过人工湖上的一座平台，建起了一处特殊的 场所，周围环绕着皇帝的起居与就寝处。

source: The degree to which spatial and visual continuity is maintained between an elevated space and its surroundings depends on the scale of the level change.
zh_cn: 抬高的空间与周围环境之间，在空间与视觉上的连续程度取决于高程变化的幅度。

source: The edge of the field is well-defined; visual and spatial continuity is maintained; physical access is easily accommodated.
zh_cn: 1.领域的边界得到很好的界定；视觉与空间的连续性依然保持；身体很容易接近。

source: Visual continuity is maintained; spatial continuity is interrupted; physical access requires the use of stairs or ramps.
zh_cn: 2.视觉连续性尚存；空间连续性被打断；身体则需要利用楼梯或坡道来接近。

source: Visual and spatial continuity is interrupted; the field of the elevated plane is isolated from the ground or floor plane; the elevated plane is transformed into a sheltering element for the space below.
zh_cn: 3.视觉与空间的连续性均被打断；抬高的基面所限定的区域已经与地面或楼板分离；抬高的基面演变成下面空间的遮蔽要素。

source: The Acropolis, the cidatel of Athens, 5th century B.C.
zh_cn: 卫城，雅典城堡，公元前五世纪

source: Izumo Shrine, Shimane Prefecture, Japan, A. D. 717 (last rebuilt in 1744)
zh_cn: 出云大社，岛根县，日本，公元717年（最后一次复建是1744年）

source: Temple of Jupiter Capitolinus, Rome, 509 B.C.
zh_cn: 朱比特神庙，罗马，公元前509年

source: Elevating a portion of the ground plane establishes a platform or podium that structurally and visually supports the form and mass of a building.
zh_cn: 地面的一部分升起来便形成了一个平台或墩座，从结构上或视觉上来看，这个平台或墩座都支撑着建筑的体块与形式。

source: The elevated ground plane can be a preexisting site condition, or it can be artificially constructed to deliberately raise a building above the surrounding context or enhance its image in the landscape.
zh_cn: 抬高的地面可以是已经存在的基地条件，也可以人工建造，目的是有意抬升建筑使其高于周围环境或者强化其在地景中的形象。

source: The examples on this and the preceding page illustrate how these techniques have been used to venerate sacred and honorific buildings.
zh_cn: 这两页的实例说明了如何把这些技法用于表现神圣与庄严的建筑。

source: Pavilion of Supreme Harmony (Taihe Dian) in the Forbidden City, Beijing, 1627
zh_cn: 太和殿，紫禁城，北京，1627

source: Temple Mountain, Bakong Temple, A.D. 881, Hariharalaya, Cambodia
zh_cn: 寺山，巴公寺，公元881年，诃利诃罗洛耶，柬埔寨

source: Valhalla, near Regensburg, Germany, Leon von Klenze, 1830-1842
zh_cn: 英烈祠，雷根斯堡附近，德国，列侬?冯?克伦策，1830--1842

source: Private courtyard of the Imperial Palace, the Forbidden City, Beijing, China, 15th century
zh_cn: 皇宫中的私密庭院，紫禁城，北京，15世纪
